In [44]:
import pandas as pd
import numpy as np

In [45]:
df1 = pd.DataFrame({'A':[4, 4], 'B':[6, 5]})
df1

   A  B
0  4  6
1  4  5

In [46]:
print(df1['A'] <= 5)  # 마스킹 연산
print(df1.query("A <= 5 and B <= 8"))  # 조건을 만족하는 행을 출력

0    True
1    True
Name: A, dtype: bool
   A  B
0  4  6
1  4  5

In [47]:
df2 = pd.DataFrame([[1, 2, 3, 4], [5, 6, 7, 8]], columns = ['A', 'B', 'C', 'D'])
df2

   A  B  C  D
0  1  2  3  4
1  5  6  7  8

In [48]:
df2.apply(lambda x : x + 1)  # 각 원소에 함수 적용

   A  B  C  D
0  2  3  4  5
1  6  7  8  9

In [49]:
def AddOne(x) :
    return x + 1
df2.apply(AddOne)  # 각 원소에 함수 적용

   A  B  C  D
0  2  3  4  5
1  6  7  8  9

In [50]:
df3 = pd.DataFrame([['A', 'B', 'C'], ['A', 'R', 'D'], ['O', 'K', 'A']])
df3

   0  1  2
0  A  B  C
1  A  R  D
2  O  K  A

In [51]:
df3.replace({'A':'X'})  # 특정 데이터값은 원하는 값으로 바꿀수 있다.

   0  1  2
0  X  B  C
1  X  R  D
2  O  K  X

In [52]:
df4 = pd.DataFrame({'Name':['Apple', 'Banana', 'Beef', 'Kimchi'], 'Frequency':[7, 3, 5, 4], 
                   'Type':['Fruit', 'Fruit', 'Meal', 'Meal']})
df4

     Name  Frequency   Type
0   Apple          7  Fruit
1  Banana          3  Fruit
2    Beef          5   Meal
3  Kimchi          4   Meal

In [53]:
df4.groupby(['Type']).sum()  # 데이터프레임을 그룹화하여 연산할수 있다.

       Frequency
Type
Fruit         10
Meal           9

In [54]:
df5 = pd.DataFrame({'Importance':[5, 6, 2, 8]})
df5 = df4.join(df5)
df5

     Name  Frequency   Type  Importance
0   Apple          7  Fruit           5
1  Banana          3  Fruit           6
2    Beef          5   Meal           2
3  Kimchi          4   Meal           8

In [55]:
df5.groupby(['Type']).aggregate([min, max, np.average])  # 데이터프레임을 그룹화하여 집계

      Frequency             Importance
            min max average        min max average
Type
Fruit         3   7     5.0          5   6     5.5
Meal          4   5     4.5          2   8     5.0

In [56]:
def my_filter(data) :
    return data["Frequency"].mean() >= 5

df5.groupby(["Type"]).filter(my_filter)  # 그룹화한 데이터를 핕터를 통해 걸러낸다.

     Name  Frequency   Type  Importance
0   Apple          7  Fruit           5
1  Banana          3  Fruit           6

In [57]:
df5.groupby(["Type"]).get_group("Fruit")  # 그룹화한 데이터에서 원하는 그룹만 출력

     Name  Frequency   Type  Importance
0   Apple          7  Fruit           5
1  Banana          3  Fruit           6

In [58]:
df5.groupby(["Type"])["Frequency"].apply(lambda x : x - x.mean())  # 그룹화하여 새로운 값을 구할수도 있다.

0    2.0
1   -2.0
2    0.5
3   -0.5
Name: Frequency, dtype: float64

In [59]:
index_list = [['1차', '1차', '2차', '2차'], ['공격', '수비', '공격', '수비']]  # 다중 인덱스
cols_list = ['1회', '2회', '3회', '4회']
data = np.random.randint(1, 10, (4, 4))
df6 = pd.DataFrame(data, index = index_list, columns = cols_list)
df6

       1회  2회  3회  4회
1차 공격   5   7   4   9
   수비   1   9   2   1
2차 공격   7   2   6   8
   수비   7   1   1   1

In [60]:
df6[["1회", "2회"]].loc["2차", "공격"]

1회    7
2회    2
Name: (2차, 공격), dtype: int32

In [61]:
df5

     Name  Frequency   Type  Importance
0   Apple          7  Fruit           5
1  Banana          3  Fruit           6
2    Beef          5   Meal           2
3  Kimchi          4   Meal           8

In [62]:
df7 = df5.pivot_table(index = "Importance", columns = "Type", values = "Frequency", aggfunc = np.max)
df7  # 피벗테이블로 테이블 재구성하기

Type        Fruit  Meal
Importance
2             NaN   5.0
5             7.0   NaN
6             3.0   NaN
8             NaN   4.0

In [66]:
%%writefile rain.csv  # csv 파일 작성
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Writing rain.csv

In [67]:
pd.read_csv("rain.csv")  # csv 파일 읽기

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [69]:
%%writefile rain_space.csv  # 띄어쓰기로 구분된 csv 파일 작성
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Overwriting rain_space.csv

In [70]:
pd.read_csv("rain_space.csv", sep = " ")  # 띄어쓰기로 구분된 csv 파일 읽기

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [71]:
pd.read_csv("rain.csv", index_col = "연도")  # 지정한 열을 인덱스로 사용하기

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [72]:
df8 = pd.DataFrame({"Weight":[62, 67, 55, 74], "Height":[165, 177, 160, 180]}, index = ["ID_1", "ID_2", "ID_3", "ID_4"])
df8.index.name = "User"
df8

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [73]:
df8.to_csv("save_df8", encoding = "utf-8-sig")  # DataFrame을 csv 파일로 저장하기

In [74]:
pd.read_csv("save_df8")

   User  Weight  Height
0  ID_1      62     165
1  ID_2      67     177
2  ID_3      55     160
3  ID_4      74     180